package com.example.abdulaziz.programlearn;

import android.support.v7.app.AppCompatActivity;
import android.os.Bundle;
import android.text.Html;
import android.widget.TextView;

public class IDE_page extends AppCompatActivity {
    TextView t,t1,t2,t3,t4,t5,t6,t7,t8,t9,t10,t11,t12;

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_ide_page);
        t=findViewById(R.id.t);
        t1=findViewById(R.id.t1);
        t2=findViewById(R.id.t2);
        t3=findViewById(R.id.t3);
        t4=findViewById(R.id.t4);
        t5=findViewById(R.id.t5);
        t6=findViewById(R.id.t6);
        t7=findViewById(R.id.t7);
        t8=findViewById(R.id.t8);
        t9=findViewById(R.id.t9);
        t10=findViewById(R.id.t10);
        t11=findViewById(R.id.t11);
        t12=findViewById(R.id.t12);



        t.setText(Html.fromHtml("<p>عند دخولك عالم البرمجة فهناك مصطلحات حتما عليك معرفتها ومعرفة استخداماتها ومن ضمن هذه المصطلحات\n" +
                "( IDE ) او بيئة التطوير المتكاملة  وهى عبارة عن بيئة توفر للمستخدم الكثير من الادوات البرمجية التى  يحتاجها  فى\n" +
                "عملية تطوير البرامج فى مكان واحد وذلك لتسهيل عملية التطوير دون الحاجة الى وقت او جهد وزيادة معدل إنتاجية البرامج وتتألف هذه البيئات البرمجية عادة على اداة لتحرير نصوص لكتابة شفرة المصدر للبرامج وكذلك تحتوى على مترجم وهو وسيط بين المبرمج وبين الحاسوب لان الحاسوب لايفهم لغة الانسان لذلك تأتى اهمية المترجم او المفسر هنا \n" +
                "وتحتوى ايضا هذه البيئات البرمجية على برنامج تتبع للبحث عن الاخطاء والمشاكل ومساعدتك فى اصلاحها والعديد من \n" +
                "الادوات الاخرى لاتمام بناء البرامج . وهناك العديد من هذه البيئات البرمجية المختلفة ولكن بدورنا قمنا باختيار افضل \n" +
                "هذه البيئات المناسبة لك بدون أن تتشتت فى عناء البحث عن افضل بيئة مناسبة لك.\n</p></font>"));

        t1.setText(Html.fromHtml("<p> هى بيئة التطوير المتكاملة الرئيسية من شركة ميكروسوفت وتتيح لك هذه البيئة برمجة وتطوير جميع انواع البرامج ,\n" +
                " بدءاً من تطبيقات الويب الى تطبيقات الموبيل الى العاب الفيديو الشهيرة وتضمن هذه البيئة الرائعة العديد من الادوات \n" +
                "لاختبار التوافق , بحيث يمكنك معرفة كيفية تشغيل تطبيقاتك على اكثر من 300 جهاز ومتصفح بفضل مرونة هذه البيئة \n" +
                "العظيمة والمفيدة لكل من الطلاب والمهنيين , وتدعم العديد من اللغات البرمجية والتى من خلالها تستطيع البدء بالبرمجة \n" +
                "باى لغة تحب أن تبرمج من خلالها بدون اى قيود على استخدام لغة معينة ومن امثلة اللغات التى تدعمها : \n" +
                "ASP.NET , DHTML , JavaScript , Jscript , Visual Basic , Visual C# , Visual C++ , Visual F# , XAML\n </p>"));

        t2.setText(Html.fromHtml("<p>    هى بيئة مفتوحة المصدر ومجانية , يستخدمها كثيراً من المطورين ومع مجتمع متنامى وعدد كبير من الشركاء العالميين \n" +
                "مايزيد عن 100 شريك , وقامت بتأسيس هذه البيئة شركة Sun Microsystems فى يونيو عام 2000 وتستمر لكى \n" +
                "تكون الراعي الرئيسي لهذه البيئة وعادة ماتسخدم لتطوير البرامج من قبل المطورين وهى اداة للمبرمجين لكتابة وبناء \n" +
                "واختبار ومتابعة الاخطاء وتجهيز البرامج للعمل وتم تطوير هذه البيئة بلغة ال Java   ولكن تدعم ايضا اى لغة برمجية \n" +
                "اخرى ومايميزها اكثر فهى مجانية ومتاحة للجميع وبدون اى قيود على طرق استخدامها ومن امثلة اللغات التى تدعمها \n" +
                "البيئة : C , C++ , C++11 , Fortan , HTML 5 , Java , PHP.\n    </p>   "));

        t3.setText(Html.fromHtml("<p>    هذه البيئة البرمجية تختلف كثيراً عن نظيراتها من البيئات البرمجية الاخرى وذلك لانه تم تطويرها خصيصاً لأجل \n" +
                "مبرمجين لغة Python ولكن لدي هذه البيئة كثيراً من المميزات الرائعة التى تعمل على تحسين الانتاجية كثيراً \n" +
                "للمبرمجين , وهذه البيئة من تطوير الشركة الرائدة فى البرمجة شركة JetBrains وهى شركة شهيرة فى تطوير العديد \n" +
                "من بيئات التطوير مما يعنى قوة هذه البيئة لمن يستخدمها , ويوجد اصدارين من هذه البيئة منها الاصدار المجانى ومنها \n" +
                "الاصدار المدفوع وهى نسخة احترافية ويأتى معها بعض المميزات التى لم تكن موجودة فى الاصدار المجانى وخصوصاً \n" +
                "لمطورى الويب .\n   </P>"));

        t4.setText(Html.fromHtml("<p>    هى عبارة عن بيئة تطوير متكاملة من شركة Jet Brains  الشهيرة فى مجال صناعة وتطوير بيئات التطوير البرمجية \n" +
                "المختلفة وما يميز هذه البيئة انها تدعم عدد كبير من اللغات البرمجية التى يمكنك من خلالها البرمجة ومن امثلة هذه \n" +
                "اللغات : AngularJS , CoffeeScript , CS , HTML , JavaScript , LESS , Node JS , PHP , Python , Ruby, Sass , TypeScript . \n" +
                "وكذلك تدعم بكل تأكيد لغة  Java وتمكنك هذه البيئة من برمجة تطبيقات الويب وتطبيقات الموبيل سواء اندرويد او \n" +
                "هواتف الايفون والكثير من المميزات اللى تجعل هذه البيئة اقوى مما تتخيل  ولكن مقابل كل هذه المميزات وكما نعلم بقوة \n" +
                "هذه الشركة فمن الطبيعي ان يكون الناتج منهم مبهر فقد قامت الشركة باصدار نسختين من هذه البيئة والنسخة الاولى \n" +
                "مجانية ومدتها 30 يوم تجريبي والاصدار الاخر مدفوع وامكانياته تفوق الاصدار التجريبي المحدود الامكانيات \n" +
                "والاستخدام .\n   </P>"));

        t5.setText(Html.fromHtml("<p>    بيئة تطويرية متكاملة تعتبر الاشهر فى مجال تطوير البرامج والتطبيقات ونالت شهرة واسعة بين اوساط المبرمجين , \n" +
                "وكتب معظمها بلغة الجافا ويمكن استخدامها فى تطوير تطبيقات لغة الجافا او اى لغات برمجية اخرى وما يميز هذه البيئة\n" +
                " انها مجانية ومتكاملة ويمكنك استخادمها باى لغة انت متمكن فيها وتبدأ البرمجة بشكل طبيعي ومن امثلة هذه اللغات التى \n" +
                "تدعمها : C , C++ , Java , Perl , PHP , Python , Ruby .\n   </P>"));

        t6.setText(Html.fromHtml("<p>    هى بيئة تطوير متكاملة ايضاً مفتوحة المصدر ومجانية للمستخدم مثلها مثل اى بيئة تطوير اخرى ولكنها لا تدعم كل\n" +
                " اللغات البرمجية مثل باقى بيئات التطوير فهى تدعم البرمجة باستخدام لغة C , C++ , Fortran  فقط ولكن لانجهل قوة \n" +
                "هذه البيئة فى البرمجة وتعمل على نظم التشغيل المختلفة منها ويندوذ وماك ولينكس واخر تحديث لهذه البيئة كان بتاريخ \n" +
                "28 شهر يناير عام 2016 فاذا كنت تستخدم اللغات السابق ذكرها يمكنك البرمجة من خلال هذه البيئة بشكل طبيعي .\n   </P>"));

        t7.setText(Html.fromHtml("<p>   هى عبارة عن بيئة تطوير مفتوحة المصدر ومجانية للمستخدم وتستخدم فى انشاء تطبيقات الويب وتدعم اكثر من لغة \n" +
                "برمجة يمكنك من خلالها البرمجة باستخدام اى لغة تجيد استخدامها مثل HTML5 , CSS3 , JavaScript , Ruby , Rails , PHP , and Python .\n" +
                " وتحتوي هذه البيئة على خصائص جميلة مثل خاصية الاكمال التقائي للكود البرمجي وبالتالى توفر عليك الجهد والوقت \n" +
                "فى كتابة الاكواد , وتعمل هذه البيئة على اكثر من نظام تشغيل من ضمنها ( ويندوذ – ماك – لينكس ) وايضاً يمكنك \n" +
                "استخدامه كأضافة ( Plugin ) فى بيئة التطوير Eclipse .\n    </P>"));

        t8.setText(Html.fromHtml("<p>    بيئة برمجية عملاقة وتعتبر من اشهر البيئات البرمجية فى مجال برمجة وتطوير تطبيقات الهواتف المحمولة التى تعمل \n" +
                "على نظام التشغيل ( اندرويد ) ومايميز هذه البيئة سهولتها ومرونتها ومجانية للجميع وبأمكانك عرض تطبيقاتك على عدة \n" +
                "شاشات محاكاة مختلفة اثناء برمجتك لتطبيق معين دون الحاجة الى وجود اجهزة كثيرة للتجربة عليها , فهى تدعم بيئة \n" +
                "محاكية تماماً للهواتف المحمولة واجهزة التابلت وذلك لتوفير الوقت والجهد على المبرمجين , وقامت شركة جوجل \n" +
                "بالاعلان عن هذه البيئة فى مؤتمر Google I / O  فى عام 2013 ومنذ ذلك الحين توالت تحديثات كثيرة على هذه البيئة\n" +
                " البرمجية مما جعلها البيئة الاولى برمجياً فى مجال برمجة وتدعم اكثر من لغة برمجية مختلفة مثل : Java / Kotlin / C / C++\n   </P>"));

        t9.setText(Html.fromHtml("<p>    هى بيئة التطوير المتكاملة وعملاق برمجة Apple  وهى بيئة قوية فى مجال تصميم وتطوير البرمجيات المختلفة من \n" +
                "العاب وبرامج وتطبيقات و تعمل على سلسلة اجهزة Apple  من هواتف وايباد وكمبيوتر ومايميز هذه البيئة السهولة \n" +
                "والمرونة والتحديثات المستمرة على هذه البيئة ولكن هذه البيئة البرمجية لاتعمل على جميع انظمة التشغيل فهى  بيئة \n" +
                "محتكرة من قبل شركة  Apple  مما يجعلها لاتعمل على اى نظام تشغيل الا نظام الماك فقط (   Mac ) الخاص \n" +
                "باجهزتهم , وتدعم هذه البيئة اكثر من لغة برمجة مثل : C , C++ , Objective-C , Objective-C++ , Java , AppleScript , Python , Ruby\n   </P>"));

        t10.setText(Html.fromHtml("<p>    هى بيئة التطوير الافتراضية التي تأتي مع منصة Xamarin ، وهي بيئة تطوير متكاملة مشابهة لفيجوال ستوديو \n" +
                "( Visual  Studio) ، مع أخذ الفارق بعين الاعتبار بين بيئة التطوير فيجوال ستوديو الاحترافية والثرية بالكثير من \n" +
                "المزايا والإمكانيات وبين  Xamarin Studio التى لازالت تحت التطوير والتحديث . وتعتبر منصة Xamarin منصة \n" +
                "لتطوير تطبيقات الهواتف الذكية على منصات متعددة( Cross-Platform ) باستخدام لغة واحدة هي لغة سي شارب\n" +
                " ( #C ) , توفر إمكانية تطوير تطبيقات اصلية ( Native Apps ) , ولاتعتبر بيئة التطوير Xamarin Studio  هي \n" +
                "البيئة الوحيدة للتطوير مع منصة Xamarin ، فهنالك Xamarin for Visual Studio ، يدعم فيجوال ستوديو التطوير\n" +
                " لمنصة Xamarin ، وبالتالي تستطيع استخدام منصة Xamarin باستخدام اى بيئة برمجية تحب ان تستخدمها .\n   </P>"));

        t11.setText(Html.fromHtml("<p>   ربما وسبق ان سمعت مسبقاً إن بيئة التطوير البرمجية تقتصر وظيفتها على تطوير البرمجيات , لكن ربما لم تسمع بأن \n" +
                "هناك بيئات برمجية لها امكانية التواصل مع الروبوت والاجهزة الالكترونية الاخرى بواسطة تنفيذ بعض العمليات \n" +
                "البرمجية التى تطلب من هذه البيئة , و هي مخصصة للفنانين والمصممين والهواة والمهندسين والتقنيين والباحثين ، أو أي\n" +
                " شخص مهتم في إنشاء مشاريع الكترونية تفاعلية . وهذه البيئة تمكنك من عمل مشاريع الكترونية بسهولة دون الحاجة \n" +
                "لأن تكون مهندس او خبير الكترونيات وبتكلفة قليلة وذلك باستخدام لغة البرمجة (  Arduino C  ) وهي شبيهه بلغة \n" +
                "السي (  C  ) الى حد كبير , ونحن الان بصدد احدى هذه البيئات البرمجية العظيمة التى تقوم بتنفيذ مايقوم به المبرمج \n" +
                "وتقوم هى بدورها بالتواصل مع الجهاز الالكترونى (  لوح الاردوينو  ) .\n    </P>"));

        t12.setText(Html.fromHtml("<p>   هى بيئة تطوير برمجية متكاملة وبها تقريباً كل مايحتاجه المطور , هى من انتاج شركة البرمجيات الشهيرة  Jet Brains  \n" +
                "ومتوفر منها نسختين , النسخة الاولى مجانية متاحة لمدة 30 يوم تجريباً بامكانيات محدودة , وهناك نسخة اخرى مدفوعة \n" +
                "بامكانيات وقدرات احترافية لكن بمقابل مالى , وهى من البيئات البرمجية المفضلة لدى مبرمجين لغة Ruby  وعلى \n" +
                "الرغم من ذلك الا انها تدعم ايضاً العديد من اللغات البرمجية المختلفة مما يجعلها مميزة ومتمكنة فى الاداء ومن امثلة هذه \n" +
                "اللغات : CoffeeScript , CSS , HAML , HTML , JavaScript , LESS , Ruby and Rails , Ruby and SASS . \n" +
                "وتعمل هذه البيئة على العديد من انظمة التشغيل مثل ويندوز / ماك / لينكس\n    </P>"));



    }
}
